## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,4 +1,4 @@
-[command]/home/runner/work/_temp/868f5c21-d3af-4a97-b4a2-4a7e43a19440/terraform-bin show -no-color tfplan-target
+[command]/home/runner/work/_temp/868f5c21-d3af-4a97-b4a2-4a7e43a19440/terraform-bin show -no-color tfplan-pr
 
 Terraform used the selected providers to generate the following execution
 plan. Resource actions are indicated with the following symbols:
@@ -12,8 +12,8 @@ Terraform will perform the following actions:
       + allow_resource_only_permissions = true
       + daily_quota_gb                  = -1
       + id                              = (known after apply)
-      + internet_ingestion_enabled      = true
-      + internet_query_enabled          = true
+      + internet_ingestion_enabled      = false
+      + internet_query_enabled          = false
       + local_authentication_disabled   = false
       + location                        = "northeurope"
       + name                            = "app-str-1-test-law"
@@ -69,6 +69,41 @@ Terraform will perform the following actions:
       + target_resource_id = (known after apply)
     }
 
+  # module.storage.azurerm_key_vault_key.kvkey[0] will be created
+  + resource "azurerm_key_vault_key" "kvkey" {
+      + curve                   = (known after apply)
+      + e                       = (known after apply)
+      + expiration_date         = "2034-10-22T18:29:59Z"
+      + id                      = (known after apply)
+      + key_opts                = [
+          + "decrypt",
+          + "encrypt",
+          + "sign",
+          + "unwrapKey",
+          + "verify",
+          + "wrapKey",
+        ]
+      + key_size                = 2048
+      + key_type                = "RSA"
+      + key_vault_id            = (known after apply)
+      + n                       = (known after apply)
+      + name                    = "app-str-1-test-storage-key-vault-key"
+      + public_key_openssh      = (known after apply)
+      + public_key_pem          = (known after apply)
+      + resource_id             = (known after apply)
+      + resource_versionless_id = (known after apply)
+      + tags                    = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "app-str-1-test"
+          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"
+        }
+      + version                 = (known after apply)
+      + versionless_id          = (known after apply)
+      + x                       = (known after apply)
+      + y                       = (known after apply)
+    }
+
   # module.storage.azurerm_private_dns_a_record.arecord[0] will be created
   + resource "azurerm_private_dns_a_record" "arecord" {
       + fqdn                = (known after apply)
@@ -149,6 +184,32 @@ Terraform will perform the following actions:
         }
     }
 
+  # module.storage.azurerm_role_assignment.identity_assigned[0] will be created
+  + resource "azurerm_role_assignment" "identity_assigned" {
+      + condition_version                = (known after apply)
+      + id                               = (known after apply)
+      + name                             = (known after apply)
+      + principal_id                     = (known after apply)
+      + principal_type                   = (known after apply)
+      + role_definition_id               = (known after apply)
+      + role_definition_name             = "Key Vault Crypto Service Encryption User"
+      + scope                            = (known after apply)
+      + skip_service_principal_aad_check = (known after apply)
+    }
+
+  # module.storage.azurerm_role_assignment.rbac_keyvault_crypto_officer["d346c9c7-0fb8-48ed-9c0f-9e048253dddc"] will be created
+  + resource "azurerm_role_assignment" "rbac_keyvault_crypto_officer" {
+      + condition_version                = (known after apply)
+      + id                               = (known after apply)
+      + name                             = (known after apply)
+      + principal_id                     = "d346c9c7-0fb8-48ed-9c0f-9e048253dddc"
+      + principal_type                   = (known after apply)
+      + role_definition_id               = (known after apply)
+      + role_definition_name             = "Key Vault Crypto Officer"
+      + scope                            = (known after apply)
+      + skip_service_principal_aad_check = (known after apply)
+    }
+
   # module.storage.azurerm_storage_account.storage[0] will be created
   + resource "azurerm_storage_account" "storage" {
       + access_tier                        = "Hot"
@@ -271,6 +332,18 @@ Terraform will perform the following actions:
             }
         }
 
+      + customer_managed_key {
+          + key_vault_key_id          = (known after apply)
+          + user_assigned_identity_id = (known after apply)
+        }
+
+      + identity {
+          + identity_ids = (known after apply)
+          + principal_id = (known after apply)
+          + tenant_id    = (known after apply)
+          + type         = "UserAssigned"
+        }
+
       + network_rules (known after apply)
 
       + queue_properties {
@@ -335,6 +408,23 @@ Terraform will perform the following actions:
       + storage_account_name = "storageq482"
     }
 
+  # module.storage.azurerm_user_assigned_identity.identity[0] will be created
+  + resource "azurerm_user_assigned_identity" "identity" {
+      + client_id           = (known after apply)
+      + id                  = (known after apply)
+      + location            = "northeurope"
+      + name                = "app-str-1-test-storage-mid"
+      + principal_id        = (known after apply)
+      + resource_group_name = "app-str-1-test-resource-group"
+      + tags                = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "app-str-1-test"
+          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"
+        }
+      + tenant_id           = (known after apply)
+    }
+
   # module.subnet.azurerm_route_table.rt[0] will be created
   + resource "azurerm_route_table" "rt" {
       + bgp_route_propagation_enabled = true
@@ -460,7 +550,7 @@ Terraform will perform the following actions:
         }
     }
 
-Plan: 19 to add, 0 to change, 0 to destroy.
+Plan: 23 to add, 0 to change, 0 to destroy.
 
 Changes to Outputs:
   + file_shares          = {
@@ -475,6 +565,6 @@ Changes to Outputs:
       + table1 = (known after apply)
     }
 ::debug::Terraform exited with code 0.
-::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.log-analytics.azurerm_log_analytics_workspace.main[0] will be created%0A  + resource "azurerm_log_analytics_workspace" "main" {%0A      + allow_resource_only_permissions = true%0A      + daily_quota_gb                  = -1%0A      + id                              = (known after apply)%0A      + internet_ingestion_enabled      = true%0A      + internet_query_enabled          = true%0A      + local_authentication_disabled   = false%0A      + location                        = "northeurope"%0A      + name                            = "app-str-1-test-law"%0A      + primary_shared_key              = (sensitive value)%0A      + resource_group_name             = "app-str-1-test-resource-group"%0A      + retention_in_days               = (known after apply)%0A      + secondary_shared_key            = (sensitive value)%0A      + sku                             = "PerGB2018"%0A      + tags                            = {%0A          + "Business_unit" = "corp"%0A          + "Environment"   = "test"%0A          + "Name"          = "app-str-1-test"%0A        }%0A      + workspace_id                    = (known after apply)%0A    }%0A%0A  # module.resource_group.azurerm_resource_group.default[0] will be created%0A  + resource "azurerm_resource_group" "default" {%0A      + id       = (known after apply)%0A      + location = "northeurope"%0A      + name     = "app-str-1-test-resource-group"%0A      + tags     = {%0A          + "Business_unit" = "corp"%0A          + "Environment"   = "test"%0A          + "Managedby"     = "hello@clouddrove.com"%0A          + "Name"          = "app-str-1-test"%0A          + "Repository"    = "https://github.com/clouddrove/terraform-azure-resource-group"%0A        }%0A%0A      + timeouts {%0A          + create = "90m"%0A          + delete = "90m"%0A          + read   = "5m"%0A          + update = "90m"%0A        }%0A    }%0A%0A  # module.storage.data.azurerm_private_endpoint_connection.private-ip-0[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_private_endpoint_connection" "private-ip-0" {%0A      + id                         = (known after apply)%0A      + location                   = (known after apply)%0A      + name                       = "app-str-1-test-storageq482-pe"%0A      + network_interface          = (known after apply)%0A      + private_service_connection = (known after apply)%0A      + resource_group_name        = "app-str-1-test-resource-group"%0A    }%0A%0A  # module.storage.azurerm_advanced_threat_protection.atp[0] will be created%0A  + resource "azurerm_advanced_threat_protection" "atp" {%0A      + enabled            = true%0A      + id                 = (known after apply)%0A      + target_resource_id = (known after apply)%0A    }%0A%0A  # module.storage.azurerm_private_dns_a_record.arecord[0] will be created%0A  + resource "azurerm_private_dns_a_record" "arecord" {%0A      + fqdn                = (known after apply)%0A      + id                  = (known after apply)%0A      + name                = (known after apply)%0A      + reco
```
See the full diff from https://github.com/ravimalvia10/terraform-azure-dummy/actions/runs/14761316633

</details>

[GitHub Actions](https://github.com/ravimalvia10/terraform-azure-dummy/actions/runs/14761316633)

<!-- diff-action -->
<!-- diff-action/Terraform Plan PR Diff/terraform-plan-diff -->